name: "ensemble_arcface"
platform: "ensemble"
max_batch_size: 16
input [
  {
    name: "ARCFACE_ENSEMBLE_INPUT"
    data_type: TYPE_UINT8
    dims: [ 112, 112, 3 ]
  }
]

output [
  {
    name: "ARCFACE_ENSEMBLE_OUTPUT"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]


ensemble_scheduling {
  step [
    {
      model_name: "arcface_preprocess"
      model_version: -1
      input_map {
        key: "ARCFACE_INPUT_0"
        value: "ARCFACE_ENSEMBLE_INPUT"
      }
      output_map {
        key: "ARCFACE_OUTPUT_0"
        value: "arcface_preprocessed_images"
      }
    },
    {
      model_name: "recognitor"
      model_version: -1
      input_map {
        key: "data"
        value: "arcface_preprocessed_images"
      }
      output_map {
        key: "fc1"
        value: "embeddings"
      }
    },
    {
      model_name: "arcface_postprocessing"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "embeddings"
      }
      output_map {
        key: "OUTPUT0"
        value: "ARCFACE_ENSEMBLE_OUTPUT"
      }
    }
  ]
}
