name: "ensemble_retinaface"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "out_det"
    data_type: TYPE_FP32
    dims: [ -1, 6 ]
  }
]
output [
  {
    name: "out_aligned_images"
    data_type: TYPE_UINT8
    dims: [ -1, 112, 112, 3 ]
  }
]
output [
  {
    name: "out_batch_mapping"
    data_type: TYPE_INT8
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "retinaface_preprocess"
      model_version: -1
      input_map {
        key: "DALI_INPUT_0"
        value: "INPUT"
      }
      output_map {
        key: "DALI_OUTPUT_0"
        value: "preprocessed_images"
      }
      output_map {
        key: "DALI_OUTPUT_1"
        value: "scaled_factors"
      }
      output_map {
        key: "Origin_images"
        value: "input_origin_images"
      }
    },
    {
      model_name: "detector"
      model_version: -1
      input_map {
        key: "data"
        value: "preprocessed_images"
      }
      output_map {
        key: "face_rpn_bbox_pred_stride32"
        value: "bbox_pred_stride32"
      }
      output_map {
        key: "face_rpn_landmark_pred_stride32"
        value: "landmark_pred_stride32"
      }
      output_map {
        key: "face_rpn_cls_prob_reshape_stride32"
        value: "cls_prob_reshape_stride32"
      }
      output_map {
        key: "face_rpn_type_prob_reshape_stride32"
        value: "type_prob_reshape_stride32"
      }
      output_map {
        key: "face_rpn_bbox_pred_stride16"
        value: "bbox_pred_stride16"
      }
      output_map {
        key: "face_rpn_landmark_pred_stride16"
        value: "landmark_pred_stride16"
      }
      output_map {
        key: "face_rpn_cls_prob_reshape_stride16"
        value: "cls_prob_reshape_stride16"
      }
      output_map {
        key: "face_rpn_type_prob_reshape_stride16"
        value: "type_prob_reshape_stride16"
      }
      output_map {
        key: "face_rpn_bbox_pred_stride8"
        value: "bbox_pred_stride8"
      }
      output_map {
        key: "face_rpn_landmark_pred_stride8"
        value: "landmark_pred_stride8"
      }
      output_map {
        key: "face_rpn_cls_prob_reshape_stride8"
        value: "cls_prob_reshape_stride8"
      }
      output_map {
        key: "face_rpn_type_prob_reshape_stride8"
        value: "type_prob_reshape_stride8"
      }
    },
    {
      model_name: "retinaface_postprocess"
      model_version: -1
      input_map {
        key: "Origin_images_in_postprocessing"
        value: "input_origin_images"
      }
      input_map {
        key: "preprocessed_scaled_factors"
        value: "scaled_factors"
      }
      input_map {
        key: "face_rpn_bbox_pred_stride32"
        value: "bbox_pred_stride32"
      }
      input_map {
        key: "face_rpn_landmark_pred_stride32"
        value: "landmark_pred_stride32"
      }
      input_map {
        key: "face_rpn_cls_prob_reshape_stride32"
        value: "cls_prob_reshape_stride32"
      }
      input_map {
        key: "face_rpn_type_prob_reshape_stride32"
        value: "type_prob_reshape_stride32"
      }
      input_map {
        key: "face_rpn_bbox_pred_stride16"
        value: "bbox_pred_stride16"
      }
      input_map {
        key: "face_rpn_landmark_pred_stride16"
        value: "landmark_pred_stride16"
      }
      input_map {
        key: "face_rpn_cls_prob_reshape_stride16"
        value: "cls_prob_reshape_stride16"
      }
      input_map {
        key: "face_rpn_type_prob_reshape_stride16"
        value: "type_prob_reshape_stride16"
      }
      input_map {
        key: "face_rpn_bbox_pred_stride8"
        value: "bbox_pred_stride8"
      }
      input_map {
        key: "face_rpn_landmark_pred_stride8"
        value: "landmark_pred_stride8"
      }
      input_map {
        key: "face_rpn_cls_prob_reshape_stride8"
        value: "cls_prob_reshape_stride8"
      }
      input_map {
        key: "face_rpn_type_prob_reshape_stride8"
        value: "type_prob_reshape_stride8"
      }

      output_map {
        key: "det"
        value: "out_det"
      }
      output_map {
        key: "aligned_images"
        value: "out_aligned_images"
      }
      output_map {
        key: "batch_mapping"
        value: "out_batch_mapping"
      }
    }
  ]
}
